/*==========================================================*
	"水仙花数"指一个三位数，其个位数字立方和等于该数本身。
	如153 = 1^3 + 5^3 + 3^3
*==========================================================*/

# include <iostream.h>
# include <iomanip.h>

int main()
{
	cout<<"\"水仙花数\"指一个三位数，其个位数字立方和等于该数本身。\n"
		<<"\n现从100开始寻找\"水仙花数\"，末端范围为999。\n"
		<<"\n下面列出所有结果：\n";
	int n;
	int daffodil( int n );
	for ( n = 100 ; n <= 999 ; n++ )
		daffodil( n );

	cout<<endl;
	return 0;
}
/*
	结果：
	153		370		371		407
*/

int daffodil( int n )
{
	int a,b,c;
	a = n / 100;
	b = ( n - a * 100 ) / 10;
	c = n %10;
	if ( a*a*a + b*b*b + c*c*c == n )//可能有些慢。
		cout<<setw(5)<<n;

	return 1;
}
