/*-----------------------------------------------------------*
	一球从h高度落下，每次落地后反跳回原高度的一半，再落下。
	求第n次落地时，共经过____m，和第n次落地反弹____m。
*-----------------------------------------------------------*/
# include <iostream.h>
# include <iomanip.h>

int main()

{
	cout<<"	   一球从h高度落下，每次落地后反跳回原高度的一半，再落下。\n"//变式
		<<"现求第n次落地时，共经过____m，和第n次落地反弹____m。\n"
		<<"\n请输入高度h和次数n：";
	//数学问题，数列求和。
	int i = 1,n;
	long double s = 0 , h;
	cin>>h>>n;

	s -= h;

	for ( i = 1 ; i <= n ; i++ )
	{
		s += h + h;
		h /= 2;
	}
	
	cout<<"\n第"<<n<<"次落地时，共经过"<<setprecision(10)<<s
		<<"m。\n第"<<n<<"次落地反弹"<<setprecision(10)<<h<<"m。\n";


	return 0;
}