/*==============================================
			   迭代法求x = 根号a。
	迭代公式：
		     1			   a
	x(n+1)= --- [ x(n) + ----- ]
			 2		      x(n)
										 (-7)
	要求前后两次求出的x的差的绝对值小于10	 。
*=============================================*/
# include <iostream.h>
# include <math.h>
# include <iomanip.h>

int main()

{
	double x = 0,y = 1,a;
	cout<<"/*==============================================\n"
		<<"		   迭代法求x = 根号a。\n"
		<<"迭代公式："<<endl
		<<"	         1             a"<<endl
		<<"	x(n+1)= --- [ x(n) + ----- ]"<<endl
		<<"	         2            x(n)"<<endl
		<<"                                     (-7)"<<endl
		<<"要求前后两次求出的x的差的绝对值小于10	 。"<<endl
		<<"*=============================================*/\n\n"
		<<"现输入a = ";

	cin>>a;
	while ( abs( y - x ) >= 1e-7 )
	{
		x = y;
		y = ( x + a / x ) / 2;

	}

	cout<<"\n对比\n"
		<<"    a = "<<setprecision(10)<<a<<endl
		<<"根号a = "<<setprecision(10)<<y<<endl;

	//结果不精准。
	return 0;
}
